---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsActualTreadDepth
source: html/2be6b587-b0ca-1cca-b2a2-70decd086688.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsActualTreadDepth Property

"Actual Tread Depth"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsActualTreadDepth { get; }
```